#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.every_three_hours will be created
  + resource "aws_cloudwatch_event_rule" "every_three_hours" {
      + arn                 = (known after apply)
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-three-hours"
      + schedule_expression = "rate(3 hours)"
    }

  # aws_cloudwatch_event_target.update_virus_definitions will be created
  + resource "aws_cloudwatch_event_target" "update_virus_definitions" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "every-three-hours"
      + target_id = "virus_definition_lambda"
    }

  # aws_cloudwatch_log_group.virus_scan_log_group will be created
  + resource "aws_cloudwatch_log_group" "virus_scan_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/bucket-antivirus-function"
      + retention_in_days = 90
    }

  # aws_cloudwatch_log_group.virus_scanner_log_group will be created
  + resource "aws_cloudwatch_log_group" "virus_scanner_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/bucket-antivirus-update"
      + retention_in_days = 90
    }

  # aws_iam_policy.virus_scan_policy will be created
  + resource "aws_iam_policy" "virus_scan_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "virus-scan-logging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_policy.virus_scanner_policy will be created
  + resource "aws_iam_policy" "virus_scanner_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "virus-scanner-logging"
      + path        = "/"
      + policy      = (known after apply)
    }

  # aws_iam_role.virus_definition_role will be created
  + resource "aws_iam_role" "virus_definition_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bucket-antivirus-update"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.virus_scan_role will be created
  + resource "aws_iam_role" "virus_scan_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bucket-antivirus-function"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.virus_definition_policy will be created
  + resource "aws_iam_role_policy" "virus_definition_policy" {
      + id     = (known after apply)
      + name   = "virus-definition-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectTagging",
                          + "s3:PutObject",
                          + "s3:PutObjectTagging",
                          + "s3:PutObjectVersionTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::my-virus-def-bkt/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.virus_scan_policy will be created
  + resource "aws_iam_role_policy" "virus_scan_policy" {
      + id     = (known after apply)
      + name   = "virus-scan-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectTagging",
                          + "s3:PutObjectTagging",
                          + "s3:PutObjectVersionTagging",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::my-virus-scan-bkt/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectTagging",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::my-virus-def-bkt/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::my-virus-scan-bkt/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_lambda_function.virus_definition_lambda will be created
  + resource "aws_lambda_function" "virus_definition_lambda" {
      + arn                            = (known after apply)
      + filename                       = "./lambdas/lambda.zip"
      + function_name                  = "bucket-antivirus-update"
      + handler                        = "update.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python2.7"
      + source_code_hash               = "fBo3GAjFHphorTHr3NPbQrGhTxBH1XqgM4LDFrCiOKs="
      + source_code_size               = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AV_DEFINITION_S3_BUCKET" = "my-virus-def-bkt"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.virus_scan_lambda will be created
  + resource "aws_lambda_function" "virus_scan_lambda" {
      + arn                            = (known after apply)
      + filename                       = "./lambdas/lambda.zip"
      + function_name                  = "bucket-antivirus-function"
      + handler                        = "scan.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python2.7"
      + source_code_hash               = "fBo3GAjFHphorTHr3NPbQrGhTxBH1XqgM4LDFrCiOKs="
      + source_code_size               = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AV_DEFINITION_S3_BUCKET"          = "my-virus-def-bkt"
              + "AV_DELETE_INFECTED_FILES"         = "True"
              + "AV_PROCESS_ORIGINAL_VERSION_ONLY" = "False"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_virus_definition_lambda will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_virus_definition_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "bucket-antivirus-update"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow_virus_scan_bucket_execution will be created
  + resource "aws_lambda_permission" "allow_virus_scan_bucket_execution" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = "arn:aws:s3:::my-virus-scan-bkt"
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

  # aws_s3_bucket_notification.virus_scan_lambda_notifications will be created
  + resource "aws_s3_bucket_notification" "virus_scan_lambda_notifications" {
      + bucket = "my-virus-scan-bkt"
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
